 REPORTX: PROCEDURE OPTIONS(MAIN);
   /* Monthly report driver */
   DECLARE CUST_NAME CHAR(30);
   DECLARE TOTAL FIXED DECIMAL(9,2);
   %INCLUDE CUSTREC;
   CALL LOADCUST;
   CALL PRINTRPT;
 END REPORTX;

 LOADCUST: PROCEDURE;
   DECLARE I FIXED BINARY;
 END LOADCUST;
