//MULTI    JOB (ACCT),'MULTI STEP',
//             CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=PROG1
//IN1      DD DSN=PROD.FILE1,DISP=SHR
//STEP2    EXEC PGM=PROG2
//OUT1     DD DSN=PROD.FILE2,DISP=(NEW,CATLG,DELETE)
//*  THIS IS A COMMENT
