//RUNPAY   JOB (ACCT),'PAYROLL RUN',CLASS=A,MSGCLASS=X
//STEP01   EXEC PGM=PAYROLL
//STEPLIB  DD DSN=PROD.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//EMPFILE  DD DSN=PROD.EMP.MASTER,DISP=SHR
